Table of Contents
 Class ReinforcementGroup
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Base class representing group reinforcement in IDEA StatiCa Detail
public abstract class ReinforcementGroup : Reinforcement
Inheritance
object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
Derived
BentUpBar
ReinfAroundOpening
ReinfBarByPolyline
ReinfBarByTwoPoints
ReinfBarInclined
ReinfBarOnEdge
ReinfBarOnMoreEdges
Inherited Members
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Cover
Cover of reinforcement
public double Cover { get; set; }
Property Value
double
 CoverFromSetting
Use cover from DetailModelSetting
public bool CoverFromSetting { get; set; }
Property Value
bool
 Diameter
Diameter o reinforcement
public double Diameter { get; set; }
Property Value
double
 DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
public double DiameterOfMandrel { get; set; }
Property Value
double
 EndsTypeBeg
End type of the beginning of reinforcement bar
public LongReinfEndType EndsTypeBeg { get; set; }
Property Value
LongReinfEndType
 EndsTypeEnd
End type of the end of reinforcement bar
public LongReinfEndType EndsTypeEnd { get; set; }
Property Value
LongReinfEndType
 NumOfBarsInLayer
Number of bars in layer
public int NumOfBarsInLayer { get; set; }
Property Value
int
 Edit this page